[{"title":"hexo搭建的博客提交文章本地预览成功但github没有显示解决方法","date":"2018-08-07T00:43:42.059Z","path":"2018/08/07/hexo搭建的博客提交文章本地预览成功但github没有显示解决方法/","text":"记录自己博客的一个坑！前几天我写了文章，想发布在博客上，谁知道在提交上去，只可以在本地预览，却不可以在github上看到，而且github上也没有提交文章的记录。这个坑我百度了很久也没有找到，直到问到人，说需要升级git，然后升级了。果然，成功提交了！！！升级git是直接在重新下载个git把原来的覆盖掉就可以了。升级完成之后记得再提交一次，比如：hexo cleanhexo ghexo d这样就可以了，如果还是不可以，可以选择清除下cookie及历史记录。我完成了上面的之后，文章算是提交上去了，但是，我的主题没有了，很悲催，没想到一坑还比一坑高，所以还是接着百度，看到了可能是我的github的仓库名字和我的hexo博客里的配置_config.yml​文件中的url名字不一样导致的试了一下，果真是可以了。这个坑是前面那个坑乱改东西留下的，不过解决了，就好！！生活不止眼前的bug，还有乐趣和斗志！","tags":[{"name":"坑","slug":"坑","permalink":"http://sergiojune.com/tags/坑/"}]},{"title":"谈谈今晚以及在跑步时的一些随想","date":"2018-05-24T14:11:38.000Z","path":"2018/05/24/谈谈今晚以及在跑步时的一些随想/","text":"今天可以算是我的第一次在讲台上分享我的技术，准备了两天左右吧，其实也没那么长，就是做了个ppt而已，由于第一次做，有很多地方都没有做好，比如字体太小了，背景和字体颜色混合了导致看不清字等等此类的问题。如果下次再做的话一定要做得好一点。还有就是我的分享有点垃圾哈，讲的内容自我感觉不是很好，也不知道需要讲什么地方，以后还是多观察下别人怎么分享吧。这次需要表扬自己的是上讲台讲台没有预料中的那么紧张，虽然讲话不是很自如，不过也比以前好多了，希望下次能更进一步吧！加油！ 说说跑步的感想！这两星期我经常跑步，跑完步还会做50个俯卧撑，虽然不太标准，不过也好过没有做吧。在跑步时会跑多几圈就会很累，就想放弃，不过我最后还是咬牙就挺着过去了。这两天跑步呢，我就想，追逐梦想就和跑步一样吧。就比如我把梦想都分成很多个小目标，跑步的圈数或者步数就是这些小小的目标。在刚开始的时候，你跑步会很顺利，小目标也是这样子，刚开始的小目标也是很容易就可以实现的。可是当你跑步的步数多了，也就是小目标实现多了，之后的每一步或每一个小目标都会显得举步维艰，这时候就需要你自己的意志力去支持着自己继续跑下去。所以说梦想也需要用自己的一生去实现，后面可能会越来越难，可你每实现的一个小目标都会把很多人甩在身后面，这些人就相当于你在跑步过程中的路人。 人生是一场永无止尽的跑步！还有这几天会经常不知道干嘛，然而还有很多事情没做，先把这些事列下来吧！线性代数课程补上 离散数学课程及作业补上 高等数学课程补上 scrapy的学习 马蜂窝网站的全站抓取 淘宝商品抓取 亚马逊模拟登陆 爬虫面试题 看 图解http 看 网络是怎样连接 了解下各种排序 不列出来都不知道有这么多事情没做，以后觉得没事的时候可以找这些事情做了。 写完，睡觉！晚安！","tags":[]},{"title":"2017年终总结","date":"2017-12-31T14:11:38.000Z","path":"2017/12/31/2017年终总结/","text":"今天是2017的最后一天了，对于2017，是我至今为止最重要的一年，在这一年中经历了人生的第一场高考，很高兴，这也是最后一场。而在下半年，我也进入了大学，虽然大学不是理想中的大学，但是我也很高兴，因为终于可以不再像高中那样了，在这里我可以学习我想要学的东西！ 上半年那时我还在准备高考，每天沉迷于题海之中，那段在一中的时间，是我高中过得最充实的时间，每天早上六点起床，晚上奋斗到差不多一点才睡。但是高三一年的勤奋拉近不了我在高中挥霍了两年的时间所带来的与别人的距离，所以在每次模拟试下来之后都在想，为啥前两年不学多一点呢？这样子在高三就不会这么辛苦，也就不会有这么大的坑让给高三的一年来填。但是我也不会后悔，因为在那两年里，我学会了踢球，懂得了人生有太多的意外，比如我在高二那年的足球班赛，我也认识了一大堆志同道合的人。所以说，对自己走过的路不曾后悔。在这半年，我度过了第一个百日誓师，还记得那天康亚华校长的谈话，还记得我们跑步的激情，还记得那天之后对未来的憧憬。。。 百日誓师，壮观！！！ 下面是我们班在百日誓师的照片 最后放张我们学校的照片吧，离开后才发现学校是真的美！ 最后六月份，走上了考场，离开了学校，最终的结果也对得起我在高三奋斗的一年！ 下半年下半年我走进了大学，大学虽然没有想象的大和好，但这始终会是我在余下四年继续坚持我奋斗的地方，所以我也爱上了这个地方。 看！ 我的大学还是很美的。还有我的班，每个都很帅很漂亮，有木有！！！在这大学半年里，我学了很多编程知识，比如c语言，python，html+css+javascript和java，学了这么多，都是因为去尝试吧，因为我暂时不知道我要往哪个方向发展，现在我知道了，我准备往爬虫，分析大数据方向，或许还有人工智能，还有就是以python为主的前端在学了这么多，自己模仿了两个网页，也做了一个简单的查看新闻app，总之还没有深入，准备下一年深入学习。不过在学习学校的课程是失败的，很多课都没有认真学习，英语也没有学好，觉得蛮遗憾的，浪费了这么多时间。还有，我也根据了网上的教程自己搭建了一个属于自己的博客，也挺不错的。而在自己博客定的小目标也没有完成多少，可能要完成的东西太多了，所以也没有完成，下一次就知道应该定多少了，嘻嘻！我在最后的一个月还参加了一个打卡活动，里面的早起和坚持锻炼我基本上算是坚持下来了，算是比较欣慰了。 引用知识星球人里一段话 人生那么长，做着枯燥而无意义的工作，每时每刻都是煎熬。 人生那么短，如果每一步成长都是令人激动的，那你一定不会说:”后悔”。 尝试，不断试错，不断碰壁，不断重来，你会发现人生有那么多的可能。会发现世界上有那么美丽的事情让我们满心欢喜。 献给现在迷茫，未来成功的你。 不忘初心，方得始终。2018，我来了！！！","tags":[{"name":"hard","slug":"hard","permalink":"http://sergiojune.com/tags/hard/"}]},{"title":"Hello World","date":"2017-11-04T23:28:16.000Z","path":"2017/11/05/helloworld/","text":"昨天博客基本搭建完毕， 搞到10点多， 只能说身心疲惫，但是觉得都值。 终于有了自己的后花园，以后发表什么还不是我说了算吗？ 哈哈 这篇文章想了很久，几个小时，总想不出要写什么， 因为觉得自己拥有了博客， 总得发个东西装逼一下， 但细想一下，又没什么好写， 想一下文采真的烂，不过没事，谁都是这样子过来的， 以后会变好的！ 最后分享一首美国诗！ 纽约时间比加州时间早三个小时， New York is 3 hours ahead of California, 但加州时间并没有变慢。 but it does not make California slow. 有人22岁就毕业了， Someone graduated at the age of 22, 但等了五年才找到好的工作！ but waited 5 years before securing a good job! 有人25岁就当上CEO， Someone became a CEO at 25, 却在50岁去世。 and died at 50. 也有人迟到50岁才当上CEO， While another became a CEO at 50, 然后活到90岁。 and lived to 90 years. 有人依然单身， Someone is still single, 同时也有人已婚。 while someone else got married. 奥巴马55岁就退休， Obama retires at 55, 川普70岁才开始当总统。 but Trump starts at 70. 世上每个人本来就有自己的发展时区。 Absolutely everyone in this world works based on their &gt;Time Zone. 身边有些人看似走在你前面， People around you might seem to go ahead of you, 也有人看似走在你后面。 some might seem to be behind you. 但其实每个人在自己的时区有自己的步程。 But everyone is running their own RACE, in their own&gt;TIME. 不用嫉妒或嘲笑他们。 Don’t envy them or mock them. 他们都在自己的时区里，你也是！ They are in their TIME ZONE, and you are in yours! 生命就是等待正确的行动时机。 Life is about waiting for the right moment to act. 所以，放轻松。 So, RELAX. 你没有落后。 You’re not LATE. 你没有领先。 You’re not EARLY. 在命运为你安排的属于自己的时区里，一切都准时。 You are very much ON TIME, and in your TIME ZONE Destiny set up for you. 我的全栈之路开启了！！！","tags":[{"name":"run","slug":"run","permalink":"http://sergiojune.com/tags/run/"}]}]